[
  {
    "id": "c20cda47-e268-4498-8609-f6d71a6e977f",
    "name": "C# Advanced",
    "teaserDescription": "Unlock the full potential of C# with our Advanced course! Elevate your coding skills with complex concepts and practical applications.",
    "description": "Dive into advanced C# programming with our comprehensive course. Explore multidimensional arrays, advanced sets, dictionaries, and data structures like stacks and queues. Master functional programming techniques to write elegant and efficient code. Learn to handle streams, files, and directories effectively. Harness the power of generics for reusable, type-safe code. Gain practical experience and elevate your skills to tackle complex challenges confidently.",
    "complexity": "Advanced",
    "credits": 15,
    "startDate": "2024-07-09",
    "endDate": "2024-08-20",
    "imageFolder": "/files/seeds/5d3017c3-aac5-4b5c-aac8-19a3a87a6c57.jpeg",
    "price": 350,
    "isActive": true,
    "teacherId": "559a0f3a-6d0e-442f-b6be-af4f1b80e6f7"
  },
  {
    "id": "182dd7b9-658e-4660-bdaf-7884cbf032ba",
    "name": "C# OOP",
    "teaserDescription": "Unlock the power of Object-Oriented Programming with our C# OOP course! Dive into fundamental concepts like classes, inheritance, polymorphism, and encapsulation.",
    "description": "Master the principles of Object-Oriented Programming (OOP) with our comprehensive C# course. Designed for both beginners and experienced developers, this course covers all essential OOP concepts, including classes, objects, inheritance, polymorphism, and encapsulation. You will learn the basics and understand the fundamentals of OOP and how to apply them in C#. Work with classes and objects to create and manage classes, and instantiate objects. Explore inheritance to create a hierarchy of classes and promote code reusability. Implement polymorphism by designing flexible and scalable code with method overriding and interfaces. Apply encapsulation to protect your data and ensure the integrity of your applications.",
    "complexity": "Advanced",
    "credits": 15,
    "startDate": "2024-08-27",
    "endDate": "2024-10-01",
    "imageFolder": "/files/seeds/8b76f5ea-db93-42c5-a375-5ef2cdd2ca58.jpg",
    "price": 450,
    "isActive": true,
    "teacherId": "559a0f3a-6d0e-442f-b6be-af4f1b80e6f7"
  },
  {
    "id": "10e174ae-9117-4612-8c76-2dfdbabc9f85",
    "name": "MS SQL",
    "teaserDescription": "Unlock the power of MS SQL with our comprehensive course! Learn to design, manage, and optimize databases, write efficient queries, and harness advanced features to boost your data management skills.",
    "description": "Dive deep into the world of MS SQL with our extensive course designed for both beginners and advanced users. Learn to design, manage, and optimize databases with a focus on practical skills. Master the essentials of CRUD operations to create, read, update, and delete data efficiently. Explore table relations to understand how different data sets interact within your database. Enhance your querying skills with subqueries and joins, enabling you to retrieve complex data sets with ease. With hands-on projects and real-world examples, you'll gain the expertise needed to write efficient queries and harness advanced MS SQL features to boost your data management capabilities",
    "complexity": "Fundamentals",
    "credits": 12,
    "startDate": "2024-07-16",
    "endDate": "2024-08-27",
    "imageFolder": "/files/seeds/9b070b95-f63e-417c-9b98-0129297d49d1.jpg",
    "price": 250,
    "isActive": true,
    "teacherId": "7963c7b1-1732-4552-9232-4f6187c2f412"
  },
  {
    "id": "4a9075de-efc2-4f00-8497-30b0eeb3406a",
    "name": "Entity Framework Core",
    "teaserDescription": "Unlock the full potential of Entity Framework Core in our comprehensive course! Learn to streamline database interactions and leverage advanced querying techniques.",
    "description": "Embark on a journey through the intricacies of data access in .NET with our comprehensive Entity Framework Core course. Starting with an introduction to ADO.NET, you'll grasp the fundamentals of data access in C# before delving into the power and convenience of Entity Framework. Master the essentials of Entity Framework, from basic CRUD operations to advanced query optimization. Learn to establish and manage entity relationships effectively, ensuring data integrity and performance. Explore the versatility of LINQ (Language-Integrated Query) to effortlessly manipulate data with C#. Take your skills to the next level with advanced querying techniques, enabling you to retrieve complex data sets efficiently. Dive into C# auto-mapping objects, simplifying the mapping process between database tables and C# classes.",
    "complexity": "Advanced",
    "credits": 15,
    "startDate": "2024-09-03",
    "endDate": "2024-10-15",
    "imageFolder": "/files/seeds/ec32f56a-e54a-4ee8-8f2a-fb5e45e6962e.jpg",
    "price": 450,
    "isActive": true,
    "teacherId": "7963c7b1-1732-4552-9232-4f6187c2f412"
  },
  {
    "id": "073161b6-0bb0-440d-bd4d-7ca5d3ae4268",
    "name": "JavaScript Basics",
    "teaserDescription": "Kickstart your programming journey with our JS Basics course! Learn the fundamentals of JavaScript, including variables and loops.",
    "description": "This course is designed for beginners looking to build a solid foundation in web development. You'll learn the essentials of JavaScript, including variables, conditional operators, loops, and built-in functions. Through hands-on exercises and practical examples, you'll gain the skills needed to start developing dynamic and efficient code. Join us and take the first step towards becoming a proficient JavaScript developer!",
    "complexity": "Basic",
    "credits": 3,
    "startDate": "2024-07-09",
    "endDate": "2024-08-06",
    "imageFolder": "/files/seeds/c980feaa-0e11-4a19-848a-970413527a21.jpg",
    "price": 50,
    "isActive": true,
    "teacherId": "f1aa915a-a411-46ca-9013-5901b5f41995"
  },
  {
    "id": "bcf799b6-68d3-406a-b230-2a1ec673afd0",
    "name": "ReactJS",
    "teaserDescription": "Master ReactJS with our hands-on course! Learn to build dynamic, high-performance web applications. Perfect for developers looking to enhance their front-end skills with modern frameworks.",
    "description": "Unlock the full potential of ReactJS with our comprehensive course! Whether you're a beginner or an experienced developer, this course will take you on a journey through building dynamic, high-performance web applications using the React library. You'll start by understanding the core concepts of React, including components, state, and props. Then, you'll dive into advanced topics such as component composition, routing with React Router, and state management with React Hooks.",
    "complexity": "Advanced",
    "credits": 12,
    "startDate": "2024-08-13",
    "endDate": "2024-09-17",
    "imageFolder": "/files/seeds/1061737e-38b3-4d97-bfac-d3be352fb907.jpg",
    "price": 350,
    "isActive": true,
    "teacherId": "f1aa915a-a411-46ca-9013-5901b5f41995"
  }
]
